#ifndef _GAME_HSFMAN_H
#define _GAME_HSFMAN_H

#include "game/hsfformat.h"
#include "game/memory.h"
#include "game/data.h"


#define HU3D_LIGHT_TYPE_SET(lightP, lightType) ((lightP)->type &= 0xFF00); \
    ((lightP)->type |= (lightType))

#define HU3D_LIGHT_TYPE_GET(lightP) ((lightP)->type & 0xFF)

//Max for model properties
#define HU3D_CLUSTER_MAX 4
#define HU3D_MODEL_LLIGHT_MAX 8

//Max for layer properties
#define HU3D_LAYER_HOOK_MAX 16
#define HU3D_LAYER_MAX 8
#define HU3D_LAYER_HOOK_POST 8

//Max for global buffers
#define HU3D_MODEL_MAX 512
#define HU3D_GLIGHT_MAX 8
#define HU3D_LLIGHT_MAX 48
#define HU3D_PROJ_MAX 4
#define HU3D_MOTION_MAX 384
#define HU3D_TEXANIM_MAX 256
#define HU3D_TEXSCROLL_MAX 16
#define HU3D_PARMAN_MAX 64
#define HU3D_WAVE_MAX 32

//Motion attributes
#define HU3D_MOTATTR 0x40000000
#define HU3D_MOTATTR_NONE 0
#define HU3D_MOTATTR_LOOP 0x40000001
#define HU3D_MOTATTR_PAUSE 0x40000002
#define HU3D_MOTATTR_REV 0x40000004
#define HU3D_MOTATTR_SHIFT_LOOP 0x40000008
#define HU3D_MOTATTR_SHIFT_PAUSE 0x40000010
#define HU3D_MOTATTR_SHIFT_REV 0x40000020
#define HU3D_MOTATTR_SHAPE_LOOP 0x40000040
#define HU3D_MOTATTR_SHAPE_PAUSE 0x40000080
#define HU3D_MOTATTR_SHAPE_REV 0x40000100
#define HU3D_MOTATTR_OVL_LOOP 0x40000200
#define HU3D_MOTATTR_OVL_PAUSE 0x40000400
#define HU3D_MOTATTR_OVL_REV 0x40000800
#define HU3D_MOTATTR_EXECSHIFT 0x40001000

#define HU3D_ATTR_MOT_RESET_LOCK (1 << 0)

//Cluster Attributes
#define HU3D_CLUSTER_ATTR ((s32)0xC0000000)

#define HU3D_ANIMID_NONE -1
#define HU3D_TEXSCRID_NONE -1
#define HU3D_CLUSTER_NONE -1
#define HU3D_PARMANID_NONE -1

//HSF_CONSTDATA attribute values
#define HU3D_CONST_NONE 0
#define HU3D_CONST_XLU (1 << 0)
#define HU3D_CONST_KCOLOR_XLU (1 << 1)
#define HU3D_CONST_REFLECT (1 << 2)
#define HU3D_CONST_SHADOW_MAP (1 << 3)
#define HU3D_CONST_FORCE_POSX (1 << 4)
#define HU3D_CONST_FORCE_POSY (1 << 5)
#define HU3D_CONST_FORCE_POSZ (1 << 6)
#define HU3D_CONST_FORCE_ROTX (1 << 7)
#define HU3D_CONST_FORCE_ROTY (1 << 8)
#define HU3D_CONST_FORCE_ROTZ (1 << 9)
#define HU3D_CONST_SHADOW (1 << 10)
#define HU3D_CONST_ALTBLEND (1 << 11)
#define HU3D_CONST_LOCK (1 << 12)
#define HU3D_CONST_DISPOFF (1 << 13)
#define HU3D_CONST_XLUVERTEX (1 << 14)
#define HU3D_CONST_HILITE (1 << 15)
#define HU3D_CONST_NEAR (1 << 16)
#define HU3D_CONST_MATHOOK (1 << 17)
#define HU3D_CONST_REFLECTMODEL (1 << 18)
#define HU3D_CONST_SHADOW_MAP_TPLVL (1 << 19)
#define HU3D_CONST_FORCE_SCALEX (1 << 20)
#define HU3D_CONST_FORCE_SCALEY (1 << 21)
#define HU3D_CONST_FORCE_SCALEZ (1 << 22)

#define HU3D_LIGHT_TYPE_SPOT 0
#define HU3D_LIGHT_TYPE_INFINITYT 1
#define HU3D_LIGHT_TYPE_POINT 2
#define HU3D_LIGHT_TYPE_STATIC 0x8000
#define HU3D_LIGHT_TYPE_NONE -1

#define HU3D_WATER_ANIM_NONE ((ANIMDATA *)1)

#define Hu3DModelDispOff(modelId) Hu3DModelAttrSet(modelId, HU3D_ATTR_DISPOFF)
#define Hu3DModelDispOn(modelId) Hu3DModelAttrReset(modelId, HU3D_ATTR_DISPOFF)

#define Hu3DModelZWriteOff(modelId) Hu3DModelAttrSet(modelId, HU3D_ATTR_ZWRITE_OFF)
#define Hu3DModelZWriteOn(modelId) Hu3DModelAttrReset(modelId, HU3D_ATTR_ZWRITE_OFF)

#define Hu3DModelMotLoopOn(modelId) Hu3DModelAttrSet(modelId, HU3D_MOTATTR_LOOP)
#define Hu3DModelMotLoopOff(modelId) Hu3DModelAttrReset(modelId, HU3D_MOTATTR_LOOP)

#define Hu3DModelCreateData(dataNum) (Hu3DModelCreate(HuDataSelHeapReadNum((dataNum), HU_MEMNUM_OVL, HEAP_MODEL)))
#define Hu3DMotionCreateData(dataNum) (Hu3DMotionCreate(HuDataSelHeapReadNum((dataNum), HU_MEMNUM_OVL, HEAP_MODEL)))
#define Hu3DJointMotionData(model, dataNum) (Hu3DJointMotion((model), HuDataSelHeapReadNum((dataNum), HU_MEMNUM_OVL, HEAP_MODEL)))

//Typedefs for various IDs
typedef s16 HU3D_MODELID;
typedef s16 HU3D_MOTIONID;
typedef s16 HU3D_PROJID;
typedef s16 HU3D_LIGHTID;
typedef s16 HU3D_LLIGHTID;
typedef s16 HU3D_PARMANID;
typedef s16 HU3D_ANIMID;
typedef s16 HU3D_TEXSCRID;

//Forward declarations
typedef struct Hu3DModel_s HU3D_MODEL;
typedef struct Hu3DDrawObj_s HU3D_DRAW_OBJ;
typedef struct Hu3DParticle_s HU3D_PARTICLE;

//Function pointer declarations
typedef void (*HU3D_LAYER_HOOK)(s16 layerNo);
typedef void (*HU3D_MODEL_HOOK)(HU3D_MODEL *modelP, Mtx *mtx);
typedef void (*HU3D_TIMING_HOOK)(HU3D_MODELID modelId, HU3D_MOTIONID motId, BOOL lagF);
typedef void (*HU3D_MAT_HOOK)(HU3D_DRAW_OBJ *drawObj, HSF_MATERIAL *material);
typedef void (*HU3D_PARTICLE_HOOK)(HU3D_MODEL *modelP, HU3D_PARTICLE *particleP, Mtx mtx);
typedef void (*HU3D_OBJ_HOOK)(HSF_OBJECT *obj, HSF_TRANSFORM *transform, Mtx *prev, Mtx *curr);

struct Hu3DDrawObj_s {
    /* 0x00 */ HU3D_MODEL *model;
    /* 0x04 */ HSF_OBJECT *object;
    /* 0x08 */ float z;
    /* 0x0C */ Mtx matrix;
    /* 0x3C */ HuVecF scale;
};

typedef struct Hu3DAttrAnim_s {
    u16 attr; //0x00
    HU3D_ANIMID animId; //0x02
    HU3D_TEXSCRID texScrId; //0x04
    HuVecF trans3D; //0x08
    HuVecF rot; //0x14
    HuVecF scale3D; //0x20
    HuVec2f scale; //0x2C
    HuVec2f trans; //0x34
    HSF_BITMAP *bitMapPtr; //0x3C
    u32 unk40;
} HU3D_ATTR_ANIM;

typedef struct HsfDrawData_s {
    s32 dlOfs;
    s32 dlSize;
    u16 polyCnt;
    u32 flags;
} HSF_DRAWDATA;

typedef struct HsfConstData_s {
    u32 attr; //0x00
    HU3D_MODELID hookMdlId; //0x04
    u8 shadowAlpha; //0x06
    HSF_DRAWDATA *drawData; //0x08
    void *dlBuf; //0x0C
    Mtx matrix; //0x10
    ANIMDATA *hiliteMap; //0x40
    HU3D_OBJ_HOOK hook; //0x44
    u32 triCnt; //0x48
} HSF_CONSTDATA;

typedef struct Hu3DMotWork_s {
    float time; //0x00
    float speed; //0x04
    float start; //0x08
    float end; //0x0C
} HU3D_MOTWORK;

struct Hu3DModel_s {
    u8 tick; //0x00
    u8 camInfoBit; //0x01
    u8 projBit; //0x02
    u8 hiliteIdx; //0x03
    s8 reflectType; //0x04
    u8 lightBit; //0x05
    s16 layerNo; //0x06
    HU3D_MOTIONID motId; //0x08
    HU3D_MOTIONID motIdOvl; //0x0A
    HU3D_MOTIONID motIdShift; //0x0C
    HU3D_MOTIONID motIdShape; //0x0E
    HU3D_MOTIONID motIdCluster[HU3D_CLUSTER_MAX]; //0x10
    s16 clusterAttr[HU3D_CLUSTER_MAX]; //0x18
    HU3D_MOTIONID motIdSrc; //0x20
    u16 cameraBit; //0x22
    HU3D_MODELID linkMdlId; //0x24
    u16 lightNum; //0x26
    u16 lightId[HU3D_GLIGHT_MAX]; //0x28
    HU3D_LIGHTID LLightId[HU3D_MODEL_LLIGHT_MAX]; //0x38
    u32 mallocNo; //0x48
    u32 mallocNoLink; //0x4C
    u32 attr; //0x50
    u32 motAttr; //0x54
    float ambR; //0x58
    float ambB; //0x5C
    float ambG; //0x64
    HU3D_MOTWORK motWork; //0x68
    HU3D_MOTWORK motOvlWork; //0x78
    HU3D_MOTWORK motShiftWork; //0x88
    HU3D_MOTWORK motShapeWork; //0x98
    float clusterTime[HU3D_CLUSTER_MAX]; //0xA8
    float clusterSpeed[HU3D_CLUSTER_MAX]; //0xB8
    union {
        HSF_DATA *hsf; //0xC8
        HU3D_MODEL_HOOK hookFunc; //0xC8
    };
    HSF_DATA *hsfLink; //0xCC
    HuVecF pos; //0xD0
    HuVecF rot; //0xDC
    HuVecF scale; //0xE8
    Mtx mtx; //0xF4
    void *hookData; //0x124
    HU3D_TIMING_HOOK timingHook; //0x128
    HSF_OBJECT *timingHookObj; //0x12C
    HU3D_MAT_HOOK matHook; //0x130
    u32 endCounter; //0x134
};

typedef struct Hu3DCamera_s {
    float fov; //0x00
    float near; //0x04
    float far; //0x08
    float aspect; //0x0C
    float upRot; //0x10
    Vec pos; //0x14
    Vec up; //0x20
    Vec target; //0x2C
    s16 scissorX; //0x38
    s16 scissorY; //0x3A
    s16 scissorW; //0x3C
    s16 scissorH; //0x3E
    float viewportX; //0x40
    float viewportY; //0x44
    float viewportW; //0x48
    float viewportH; //0x4C
    float viewportNear; //0x50
    float viewportFar; //0x54
} HU3D_CAMERA;

typedef struct Hu3DProjection_s {
    u8 alpha; //0x00
    ANIMDATA *anim; //0x04
    float fov; //0x08
    float near; //0x0C
    float far; //0x10
    HuVecF camPos; //0x14
    HuVecF camTarget; //0x20
    HuVecF camUp; //0x2C
    Mtx lookAtMtx; //0x38
    Mtx projMtx; //0x68
} HU3D_PROJECTION;

typedef struct Hu3DShadow_s {
    GXColor color; //0x00
    u16 size; //0x04
    void *buf; //0x08
    float fov; //0x0C
    float near; //0x10
    float far; //0x14
    HuVecF camPos; //0x18
    HuVecF camTarget; //0x24
    HuVecF camUp; //0x30
    Mtx lookAtMtx; //0x3C
    Mtx projMtx; //0x6C
} HU3D_SHADOW;

typedef struct Hu3DLight_s {
    s16 type; //0x00
    s16 func; //0x02
    float cutoff; //0x04
    float brightness; //0x08
    u8 unkC[16];
    HuVecF pos; //0x1C
    HuVecF dir; //0x28
    HuVecF offset; //0x34
    GXColor color; //0x40
} HU3D_LIGHT;

typedef struct Hu3DMotion_s {
    u16 attr; //0x00
    HU3D_MODELID modelId; //0x02
    HSF_DATA *hsf; //0x04
} HU3D_MOTION;

typedef struct Hu3DParticleData_s {
    s16 time; //0x00
    HU3D_PARMANID parManId; //0x02
    s16 attr; //0x04
    s16 cameraBit; //0x06
    HuVecF vel; //0x08
    HuVecF accel; //0x14
    float speedDecay; //0x20
    float colorIdx; //0x24
    float scaleBase; //0x28
    float scale; //0x2C
    float scaleY; //0x30
    float zRot; //0x34
    HuVecF pos; //0x38
    GXColor color; //0x44
} HU3D_PARTICLE_DATA;

typedef struct Hu3DParticle_s {
    s16 dataCnt; //0x00
    s16 emitCnt; //0x02
    HuVecF pos; //0x04
    HuVecF unk_10;
    void *work; //0x1C
    s16 animBank; //0x20
    s16 animNo; //0x22
    float animSpeed; //0x24
    float animTime; //0x28
    u8 blendMode; //0x2C
    u8 attr; //0x2D
    s16 unk_2E;
    s16 maxCnt; //0x30
    u32 count; //0x34
    u32 prevCounter; //0x38
    u32 prevCount; //0x3C
    u32 dlSize; //0x40
    ANIMDATA *anim; //0x44
    HU3D_PARTICLE_DATA *data; //0x48
    HuVecF *vtxBuf; //0x4C
    void *dlBuf; //0x50
    HU3D_PARTICLE_HOOK hook; //0x54
} HU3D_PARTICLE; 

typedef struct Hu3DParmanParam_s {
    s16 maxTime; //0x00
    s16 unk2;
    float accelRange; //0x04
    float scaleRange; //0x08
    float angleRange; //0x0C
    Vec gravity; //0x10
    float speedBase; //0x1C
    float speedDecay; //0x20
    float scaleBase; //0x24
    float scaleDecay; //0x28
    s16 colorNum; //0x2C
    GXColor colorStart[4]; //0x2E
    GXColor colorEnd[4]; //0x3E
} HU3D_PARMAN_PARAM;

typedef struct Hu3DTexAnim_s {
    u16 attr; //0x00
    s16 bank; //0x02
    s16 anmNo; //0x04
    HU3D_MODELID modelId; //0x06
    float time; //0x08
    float speed; //0x0C
    ANIMDATA *anim; //0x10
} HU3D_TEXANIM; // Size 0x14

typedef struct Hu3DTexScroll_s {
    u16 attr; //0x00
    HU3D_MODELID modelId; //0x02
    HuVecF pos; //0x04
    HuVecF scale; //0x10
    HuVecF posMove; //0x1C
    HuVecF scaleMove; //0x28
    float rot; //0x34
    float rotMove; //0x38
    Mtx texMtx; //0x3C
} HU3D_TEXSCROLL;

typedef struct Hu3DParMan_s {
    HU3D_MODELID modelId; //0x00
    s16 attr; //0x02
    s16 timeLimit; //0x04
    HU3D_PARMANID parManId; //0x06
    s16 color; //0x08
    Vec pos; //0x0C
    Vec vec; //0x18
    Vec vacuum; //0x24
    float vacuumSpeed; //0x30
    float accel; //0x34
    s32 jitterNo; //0x38
    HU3D_PARMAN_PARAM *param; //0x3C
} HU3D_PARMAN;

typedef struct Hu3DWaterWave_s {
    HuVecF pos; //0x00
    float radiusMax; //0x0C
    float radius; //0x10
    float texMtx[2][3]; //0x14
    s16 time; //0x2C
} HU3D_WATERWAVE;

typedef struct Hu3DWater_s {
    s16 layerNo;
    u16 cameraBit;
    float texMtx[2][3];
    s16 glowMode;
    s16 fbWaterW;
    s16 fbWaterH;
    void *fbWater;
    ANIMDATA *animBump;
    ANIMDATA *animSurface;
    ANIMDATA *animSky;
    ANIMDATA *animWave;
    void *fbDisp;
    HuVecF texPos;
    HuVecF texScale;
    HuVecF posMin;
    HuVecF posMax;
    float padY;
    GXColor glowCol;
    GXColor hiliteCol;
    BOOL mipMapF;
    s16 unk7C;
    HU3D_WATERWAVE wave[HU3D_WAVE_MAX];
    float maxTime;
} HU3D_WATER;

void Hu3DDrawInit(void);

void Hu3DDrawPreInit(void);
void Hu3DDraw(HU3D_MODEL *model, Mtx matrix, HuVecF *scale);
BOOL ObjCullCheck(HSF_DATA *hsf, HSF_OBJECT *object, Mtx mtx);
void Hu3DTevStageNoTexSet(HU3D_DRAW_OBJ *drawObj, HSF_MATERIAL *matP);
void Hu3DTevStageTexSet(HU3D_DRAW_OBJ *drawObj, HSF_MATERIAL *matP);
void Hu3DMatLightSet(HU3D_MODEL *modelP, u32 flags, float hilitePower);
void Hu3DDrawPost(void);
